Revit 2027 API
MultistoryStairs.GetStairsOnLevel Method
 Gets the individual stairs or stairs group on the given base level.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Stairs GetStairsOnLevel(
	ElementId levelId
)
Public Function GetStairsOnLevel (
	levelId As ElementId
) As Stairs
public:
Stairs^ GetStairsOnLevel(
	ElementId^ levelId
)
member GetStairsOnLevel :
        levelId : ElementId -> Stairs
Parameters
levelId ElementId
 The base level id.
Return Value
Stairs
 The id of stairs element on the given level.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace